/*
А может быть это шифр? Может быть, но это не точно.

Вам надо проверить, что 2 данные строки изометричны. Это значит что символ из одной строки может стать в соответствие
символам из другой строки.

Один символ одной строки может соответствовать только одному символу другой строки.
Два или более символа одной строки могут соответствовать одному символу другой строки, но не наоборот.

Example:

isometricStrings('add', 'egg') == true
isometricStrings('foo', 'bar') == false
isometricStrings('', '') == true
isometricStrings('all', 'all') == true
isometricStrings('gogopy', 'doodle') == false

 */